#include <math.h>
#include "paths.h"

int coors(double x[3],
	  double ak[3],
	  double xa[3],
	  double xd[3],
	  double aka[3],
	  double akd[3],
	  double r,
	  double r1,
	  double sgn,
	  double *p,
	  double *f,
	  double *t,
	  int    key)
/************************************************************************/
/*                                                                      */
/*     ποδπςοηςαννα χωώισμρετ πο λοοςδιξαταν τοώλι θ ξα ποχεςθξοστι     */
/*     ϊενμι λοοςδιξατω τοώλι χθοδα χ ιοξοσζεςυ x1, ιμι οβςατξυΰ        */
/*     οπεςαγιΰ.                                                        */
/*                                                                      */
/* x  -δελαςτοχω λοοςδιξατω ισθοδξοκ τοώλι;                             */
/* ak -δελαςτοχω λονποξεξτω χομξοχοηο χελτοςα;                          */
/* xa -πςοιϊχοδξωε σζεςιώεσλιθ λοοςδιξατ τοώλι πο αϊινυτυ;              */
/* xd -πςοιϊχοδξωε σζεςιώεσλιθ λοοςδιξατ τοώλι πο υημυ νεστα;           */
/* aka-πςοιϊχοδξωε δελαςτοχωθ λονποξεξτ χομξοχοηο χελτοςα πο αϊινυτυ;   */
/* akd-πςοιϊχοδξωε δελαςτοχωθ λονποξεξτ χομξοχοηο χελτοςα πο υημυ νεστα;*/
/* r  -ξαώαμψξαρ χωσοτα τοώλι;                                          */
/* r1 -λοξεώξαρ χωσοτα τοώλι;                                           */
/* sgn- 1 , εσμι χοσθοδρύαρ τςαελτοςιρ, -1 , εσμι ξιϊθοδρύαρ;           */
/* *p  -χξειοξοσζεςξαρ ώαστψ ηςυπποχοηο πυτι;                           */
/* *f  -σζεςιώεσλαρ λοοςδιξατα τοώλι;                                   */
/* *t  -σζεςιώεσλαρ λοοςδιξατα τοώλι;                                   */
/* key - 1 , εσμι ώισμο ιξτεηςιςυενωθ υςαχξεξικ ξε βομψϋε 8.            */
/*                                                                      */
/* ζυξλγιρ χοϊχςαύαετ 1, εσμι μυώ ξε νοφετ ποπαστψ ξα ϊενμΰ,            */
/* ιξαώε - 0.                                                           */
/*                                                                      */
/*VGG                                                                   */
/************************************************************************/
{
    double x1[3],akx,det,stcf,stsf,ctcf,ctsf,
           sf0,cf0,st0,ct0;


  akx=ak[0]*x[0]+ak[1]*x[1]+ak[2]*x[2];
  det=akx*akx+r1*r1-r*r;

  if (det<.0) return 1;

  sf0=sf;
  cf0=cf;
  st0=st;
  ct0=ct;

  *p=-akx+sgn*sqrt(det);

  //printf("\np=%f  akx=%f  det=%f",*p,akx,det);

  x1[0]=x[0]+ak[0]**p;
  x1[1]=x[1]+ak[1]**p;
  x1[2]=x[2]+ak[2]**p;

  ct=x1[2]/r1;
  st=sqrt(1.-ct*ct);
  sf=x1[1]/(r1*st);
  cf=x1[0]/(r1*st);

  *f=atan2(sf,cf);
  *t=atan2(st,ct);

  if (key) return 0;

  stsf=st0*sf0;
  stcf=st0*cf0;
  ctsf=ct0*sf0;
  ctcf=ct0*cf0;

  x1[0]=stcf*xa[2]+r*ctcf*xa[1]-r*stsf*xa[0];
  x1[1]=stsf*xa[2]+r*ctsf*xa[1]+r*stcf*xa[0];
  x1[2]=ct0*xa[2]-r*st0*xa[1];

  xa[2]=(r*xa[2]+*p*(x1[0]*ak[0]+x1[1]*ak[1]+x1[2]*ak[2]+
	x[0]*aka[0]+x[1]*aka[1]+x[2]*aka[2]))/r1;
  xa[1]=-(x1[2]+*p*aka[2]-ct*xa[2])/(r1*st);
  xa[0]=(cf*(x1[1]+*p*aka[1])-sf*(x1[0]+*p*aka[0]))/(st*r1);

  x1[0]=stcf*xd[2]+r*ctcf*xd[1]-r*stsf*xd[0];
  x1[1]=stsf*xd[2]+r*ctsf*xd[1]+r*stcf*xd[0];
  x1[2]=ct0*xd[2]-r*st0*xd[1];

  xd[2]=(r*xd[2]+*p*(x1[0]*ak[0]+x1[1]*ak[1]+x1[2]*ak[2]+
	x[0]*akd[0]+x[1]*akd[1]+x[2]*akd[2]))/r1;
  xd[1]=-(x1[2]+*p*akd[2]-ct*xd[2])/(r1*st);
  xd[0]=(cf*(x1[1]+*p*akd[1])-sf*(x1[0]+*p*akd[0]))/(st*r1);

  return 0;
} /* coors */